In [74]:
import pandas as pd

In [75]:
df = pd.read_csv('BlackFriday.csv')

In [76]:
df.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [77]:
list(df.columns)

['User_ID',
 'Product_ID',
 'Gender',
 'Age',
 'Occupation',
 'City_Category',
 'Stay_In_Current_City_Years',
 'Marital_Status',
 'Product_Category_1',
 'Product_Category_2',
 'Product_Category_3',
 'Purchase']

In [78]:
df.nunique()

User_ID                        5891
Product_ID                     3623
Gender                            2
Age                               7
Occupation                       21
City_Category                     3
Stay_In_Current_City_Years        5
Marital_Status                    2
Product_Category_1               18
Product_Category_2               17
Product_Category_3               15
Purchase                      17959
dtype: int64

In [79]:
df['Age'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [80]:
df.head(3)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422

In [81]:
df.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     537577 non-null  int64
 1   Product_ID                  537577 non-null  object
 2   Gender                      537577 non-null  object
 3   Age                         537577 non-null  object
 4   Occupation                  537577 non-null  int64
 5   City_Category               537577 non-null  object
 6   Stay_In_Current_City_Years  537577 non-null  object
 7   Marital_Status              537577 non-null  int64
 8   Product_Category_1          537577 non-null  int64
 9   Product_Category_2          370591 non-null  float64
 10  Product_Category_3          164278 non-null  float64
 11  Purchase                    537577 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 49.2+ MB

In [83]:
df['City_Category'].unique()

array(['A', 'C', 'B'], dtype=object)

In [84]:
df.groupby('City_Category').count()

,User_ID,Product_ID,Gender,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
City_Category,,,,,,,,,,,
A,144638,144638,144638,144638,144638,144638,144638,144638,96755,40848,144638
B,226493,226493,226493,226493,226493,226493,226493,226493,155248,68185,226493
C,166446,166446,166446,166446,166446,166446,166446,166446,118588,55245,166446

In [85]:
df.groupby('City_Category').size()

City_Category
A    144638
B    226493
C    166446
dtype: int64

In [86]:
df.groupby('City_Category').count()['Age']

City_Category
A    144638
B    226493
C    166446
Name: Age, dtype: int64

In [87]:
df['Gender'].unique()

array(['F', 'M'], dtype=object)

In [88]:
df['Gender'].nunique()

2

In [89]:
df.groupby('Gender',).size()

Gender
F    132197
M    405380
dtype: int64

In [90]:
count = 0
for i in df['Gender']:
    if i == 'M':
        count = count + 1
print (count)

405380

In [98]:
df['Occupation'].unique()

array([10, 16, 15,  7, 20,  9,  1, 12, 17,  0,  3,  4, 11,  8, 19,  2, 18,
        5, 14, 13,  6])

In [95]:
df.groupby(['Gender','Occupation']).size()

Gender  Occupation
F       0             17658
        1             17431
        2              8402
        3              7767
        4             17340
        5              2160
        6              7971
        7              9707
        8               357
        9              5707
        10             3912
        11             1454
        12             3387
        13             1445
        14             6621
        15             2302
        16             3996
        17             3742
        18              216
        19             1974
        20             8648
M       0             50462
        1             28540
        2             17443
        3              9599
        4             53522
        5              9825
        6             11851
        7             48099
        8              1167
        9               446
        10             8711
        11             9884
        12            27036
        13             6103
        14            20091
        15             9510
        16            20794
        17            35348
        18             6309
        19             6378
        20            24262
dtype: int64

In [97]:
df[['Gender', 'Occupation']]

       Gender  Occupation
0           F          10
1           F          10
2           F          10
3           F          10
4           M          16
...       ...         ...
537572      M          16
537573      M          16
537574      M          16
537575      M          16
537576      M          16

[537577 rows x 2 columns]